OpenFOAM-v1812/tutorials/combustion/fireFoam/LES/oppositeBurningPanels/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ground
    {
        type        compressible::alphatWallFunction;
        value       uniform 0;
    }

    top
    {
        type        zeroGradient;
    }

    burner
    {
        type        zeroGradient;
    }

    sides
    {
        type        zeroGradient;
    }

    "(region0_to.*)"
    {
        type        compressible::alphatWallFunction;
        value       uniform 0;
    }
}


// ************************************************************************* //
